<h3><center>Data Munging</center></h3>

<h6><center>Joins</center></h6>

In [1]:
import pandas as pd

In [2]:
pedreiros1 = {'pedreiro':[1, 2], 'nome': ['Lionel', 'Cistiano'], 'sobrenome': ['Messi', 'Ronaldo']}; pedreiros1

{'pedreiro': [1, 2],
 'nome': ['Lionel', 'Cistiano'],
 'sobrenome': ['Messi', 'Ronaldo']}

In [3]:
frame01 = pd.DataFrame(pedreiros1); frame01

   pedreiro      nome sobrenome
0         1    Lionel     Messi
1         2  Cistiano   Ronaldo

In [4]:
pedreiros2 = {'pedreiro':[1, 3], 'nome': ['Robert', 'Neymar'], 'sobrenome': ['Lewandowski', 'Jr']}; pedreiros2

{'pedreiro': [1, 3],
 'nome': ['Robert', 'Neymar'],
 'sobrenome': ['Lewandowski', 'Jr']}

In [5]:
frame02 = pd.DataFrame(pedreiros2); frame02

   pedreiro    nome    sobrenome
0         1  Robert  Lewandowski
1         3  Neymar           Jr

In [6]:
serventes = {'pedreiro': [1, 2, 3], 'servente': ['Carson Wentz', 'Fletcher Cox', 'Miles Sanders']}

In [7]:
frame03 = pd.DataFrame(serventes); frame03

   pedreiro       servente
0         1   Carson Wentz
1         2   Fletcher Cox
2         3  Miles Sanders

In [8]:
# concating and changing the index
concat_lines = pd.concat([frame01, frame02]); concat_lines.index = range(concat_lines.index.size)

In [9]:
concat_lines

   pedreiro      nome    sobrenome
0         1    Lionel        Messi
1         2  Cistiano      Ronaldo
2         1    Robert  Lewandowski
3         3    Neymar           Jr

In [10]:
# concating and changing the index
concat_colums = pd.concat([frame01, frame02], axis=1); concat_colums

   pedreiro      nome sobrenome  pedreiro    nome    sobrenome
0         1    Lionel     Messi         1  Robert  Lewandowski
1         2  Cistiano   Ronaldo         3  Neymar           Jr

In [11]:
merge1 = pd.merge(concat_lines, frame03, on = 'pedreiro'); merge1

   pedreiro      nome    sobrenome       servente
0         1    Lionel        Messi   Carson Wentz
1         1    Robert  Lewandowski   Carson Wentz
2         2  Cistiano      Ronaldo   Fletcher Cox
3         3    Neymar           Jr  Miles Sanders

In [12]:
# Beware Nan
merge2 = pd.merge(frame01, frame02, on = 'pedreiro', how = 'outer'); merge2

   pedreiro    nome_x sobrenome_x  nome_y  sobrenome_y
0         1    Lionel       Messi  Robert  Lewandowski
1         2  Cistiano     Ronaldo     NaN          NaN
2         3       NaN         NaN  Neymar           Jr

In [13]:
# Beware Nan
merge3 = pd.merge(frame01, frame02, on = 'pedreiro', how = 'left'); merge3

   pedreiro    nome_x sobrenome_x  nome_y  sobrenome_y
0         1    Lionel       Messi  Robert  Lewandowski
1         2  Cistiano     Ronaldo     NaN          NaN

In [14]:
# Beware Nan
merge4 = pd.merge(frame01, frame02, right_index=True, left_index=True); merge4

   pedreiro_x    nome_x sobrenome_x  pedreiro_y  nome_y  sobrenome_y
0           1    Lionel       Messi           1  Robert  Lewandowski
1           2  Cistiano     Ronaldo           3  Neymar           Jr

In [15]:
# Beware Nan
merge5 = pd.merge(frame01, frame02, on = 'pedreiro', how = 'right', suffixes=(' - tabela1', ' - tabela2')); merge5

,pedreiro,nome - tabela1,sobrenome - tabela1,nome - tabela2,sobrenome - tabela2
0,1,Lionel,Messi,Robert,Lewandowski
1,3,NaN,NaN,Neymar,Jr